{
  "companies": [
    {
      "name": "Kidzovo",
      "period": "Apr 2022 - Present",
      "description": "Building an award-winning app for kids with the help of AI",
      "thumbnail": "/images/projects/kidzovo/thumbnail.png",
      "logo": {
        "dark": "/images/projects/kidzovo/kidzovo_logo.png",
        "light": "/images/projects/kidzovo/kidzovo_logo.png"
      },
      "projects": [
        {
          "name": "Kidzovo App",
          "description": "Designed intuitive and engaging interactions for children's learning experience",
          "thumbnail": "/images/projects/kidzovo/project-image-1.jpg",
          "tags": [
            "Product Design",
            "UX/UI",
            "Education"
          ],
          "details": {
            "title": "Case Study: Designing \"Kidzovo\" - An AI-Powered Learning Platform for Young Minds",
            "projectOverview": "Kidzovo was envisioned as a revolutionary educational platform aimed at children aged 2-8. The core challenge was to create an engaging, intuitive, and adaptive learning experience that leveraged artificial intelligence to personalize content and foster a love for learning, all while maintaining a strong focus on user-friendly interfaces suitable for young learners.",
            "theChallenge": {
              "heading": "The Challenge: Engaging Young Minds with AI",
              "description": "Traditional learning apps often struggle to keep children consistently engaged. Our primary challenge was to integrate sophisticated AI capabilities (like adaptive learning paths and personalized feedback) without overwhelming our young users. This meant designing interfaces that were:",
              "interfaceQualities": [
                "Visually Appealing & Playful: Bright colors, friendly characters, and clear iconography were paramount.",
                "Intuitively Navigable: Minimizing text, relying on visual and audio cues, and simplifying interaction flows.",
                "Error-Tolerant & Forgiving: Allowing children to explore without fear of \"failure.\"",
                "Adaptive, Not Overtly Complex: The AI's intelligence needed to be subtle, guiding rather than dictating."
              ]
            },
            "ourApproach": {
              "heading": "Our Approach: User-Centered Design with an AI Core",
              "description": "We adopted a highly iterative, user-centered design (UCD) approach, deeply integrating AI considerations from the outset.",
              "phases": [
                {
                  "name": "Phase 1: Research & Discovery",
                  "points": [
                    "Target Audience Deep Dive: We conducted extensive research with children, parents, and educators to understand learning behaviors, attention spans, and common frustrations with existing educational tools. Observations revealed a strong preference for gamified elements, immediate feedback, and clear, simple instructions.",
                    "AI Opportunity Mapping: We identified key areas where AI could enhance learning:",
                    "Adaptive Curriculum: Adjusting difficulty and content based on a child's progress and learning style.",
                    "Personalized Feedback: Offering constructive and encouraging responses tailored to specific mistakes.",
                    "Engagement Prediction: Identifying moments when a child might lose interest and suggesting alternative activities.",
                    "Content Curation: Recommending new topics or activities based on demonstrated interests."
                  ]
                },
                {
                  "name": "Phase 2: Prototyping & Iteration",
                  "points": [
                    "Low-Fidelity Wireframes: We started with basic sketches, prioritizing large touch targets, minimal on-screen clutter, and clear visual hierarchy.",
                    "Interactive Prototypes: Using tools like Figma and Rive (for character animations), we built interactive prototypes. The AI's \"presence\" was designed to feel like a friendly companion, offering hints or praise, rather than a judging entity.",
                    "Usability Testing with Children: This was crucial. We observed children interacting with the prototypes, noting where they got stuck, what delighted them, and how they responded to different AI feedback mechanisms. For instance, initial text-heavy feedback was replaced with animated character reactions and simple verbal cues.",
                    "Gamification Elements: Points, badges, and progress bars were integrated to provide a sense of achievement, but always secondary to the learning objective."
                  ]
                },
                {
                  "name": "Phase 3: Analysing Usage & Iteration",
                  "points": [
                    "Continuous Usage Analysis: We implemented robust analytics to collect anonymized interaction data (e.g., time spent on tasks, completion rates, common errors, navigation paths). This data was crucial for understanding real-world user behavior and identifying areas for improvement.",
                    "Iterative Content & Feature Refinement: Based on usage data and ongoing user feedback, we continuously refined existing content, adjusted learning paths, and developed new features. This agile approach allowed us to quickly respond to user needs and optimize the learning experience.",
                    "Performance Monitoring & Feedback Loop: We established a clear feedback loop between our analytics, design, and development teams. Regular reviews of performance metrics and user insights informed subsequent iterations, ensuring the AI models and content remained highly effective and engaging.",
                    "Agile Development & Deployment: Our development process was structured around agile methodologies, enabling rapid prototyping, testing, and deployment of updates. This allowed us to quickly integrate insights from usage analysis into the platform."
                  ]
                }
              ]
            },
            "keyOutcomes": {
              "heading": "Key Outcomes",
              "points": [
                "Enhanced Engagement: Kidzovo achieved significantly higher retention rates and longer average session times compared to benchmark educational apps. Children were genuinely excited to interact with the platform.",
                "Personalized Learning Journeys: The adaptive AI successfully tailored learning paths, allowing children to progress at their own pace and focus on areas where they needed more support.",
                "Positive Parent Feedback: Parents reported that their children were more motivated to learn and found the platform intuitive and easy to use independently.",
                "Scalable Design System: The robust UI/UX design system developed during the project ensured consistency and efficiency for future content additions and feature expansions."
              ]
            },
            "lessonsLearned": {
              "heading": "Lessons Learned",
              "points": [
                "Simplicity is King for Kids: Even with complex AI under the hood, the user-facing experience must remain incredibly simple and direct.",
                "AI as a Companion, Not a Teacher: Children respond best when AI acts as a supportive friend, not a strict instructor.",
                "Iterate with the Target Audience: Continuous testing with children is non-negotiable. Their unfiltered feedback is invaluable.",
                "Visual Storytelling: Animations and engaging visuals are powerful tools for communicating complex ideas and providing feedback without relying on extensive text."
              ]
            },
            "conclusion": "Building Kidzovo demonstrated that AI can revolutionize children's education by providing truly personalized and engaging experiences. By prioritizing user-friendly interfaces and integrating AI thoughtfully, we created a platform that not only teaches but also inspires young learners to explore and discover."
          },
          "url": "https://link.kidovo.com/RL7v/promad",
          "urlName": "Download Kidzovo App"
        },
        {
          "name": "Character design and animation",
          "description": "Designed and animated playful character states and expressions",
          "thumbnail": "/images/projects/kidzovo/project-image-2.jpg",
          "tags": [
            "Character Design",
            "Animation",
            "Rive"
          ],
          "details": {
            "title": "Case Study: Building a Scalable Mascot with Rive",
            "projectOverview": "The goal was to create a lively, interactive mascot for the Kidzovo app to guide and engage young users. We needed a solution that was not only expressive but also highly performant and scalable across multiple platforms. Rive was chosen to bring our character, 'Ovo', to life with real-time vector animations.",
            "theChallenge": {
              "heading": "The Challenge: A Dynamic, Performant, and Scalable Mascot",
              "description": "Traditional animation formats like GIFs or video files were not a viable option. They are large, not easily scalable without quality loss, and offer limited interactivity. The challenge was to create complex character animations that were lightweight, crisp on any screen size, and could respond to user interactions in real-time.",
              "animationGoals": [
                "Scalability: Animations must be vector-based to look sharp on any device.",
                "Performance: The animation solution needed a small footprint to keep the app fast and responsive.",
                "Interactivity: The mascot needed to react dynamically to a child's learning progress and inputs.",
                "Ease of Iteration: We needed a workflow that allowed designers to quickly create and modify complex animations without writing code."
              ]
            },
            "ourApproach": {
              "heading": "Our Approach: Real-time Vector Animation with a State Machine",
              "description": "We chose Rive for its powerful real-time vector animation capabilities and its state machine, which allows for complex interactive logic to be built visually. This approach solved our core challenges around performance, scalability, and interactivity.",
              "phases": [
                {
                  "name": "Phase 1: Character Rigging and State Planning",
                  "points": [
                    "Mascot Design: Finalizing the design of 'Ovo' the mascot for animation-friendliness.",
                    "State Definition: Defining all the character's states, such as 'idle', 'happy', 'thinking', 'guiding', and 'celebrating'.",
                    "State Machine Logic: Visually mapping out the transitions between these states in the Rive editor based on potential user interactions (e.g., correct answer, wrong answer, inactivity)."
                  ]
                },
                {
                  "name": "Phase 2: Animation and Implementation",
                  "points": [
                    "Animating in Rive: Building the animations for each state using Rive's powerful toolset, including bones for efficient rigging.",
                    "Integrating with Rive Runtimes: Using the Rive runtimes for iOS, Android, and web to load the animations into the Kidzovo app.",
                    "Connecting Logic: Triggering state changes in the Rive state machine from the application code based on user actions, making 'Ovo' feel truly alive."
                  ]
                }
              ]
            },
            "keyOutcomes": {
              "heading": "Key Outcomes",
              "points": [
                "Enhanced User Engagement: The interactive and expressive mascot led to a more engaging and delightful user experience for children.",
                "High Performance, Low Footprint: Rive animations were extremely lightweight, ensuring the app's performance was not compromised.",
                "Seamless Scalability: The vector-based mascot animations were perfectly crisp across all screen sizes and resolutions.",
                "Accelerated Workflow: Rive's collaborative tools allowed our designers to create and iterate on complex interactive animations independently, freeing up developer time."
              ]
            },
            "lessonsLearned": {
              "heading": "Lessons Learned",
              "points": [
                "State Machines Empower Designers: Rive's state machine allows designers to control complex logic and interactivity without needing to code.",
                "Vector is Superior for UI Animation: For application UIs, vector animations provide a level of quality and flexibility that raster formats can't match.",
                "Interactive Animation Drives Connection: Making the mascot respond to a child's actions created a stronger, more personal bond with the user.",
                "A Single Source of Truth: Having one Rive file for all platforms simplified asset management and ensured a consistent experience everywhere."
              ]
            },
            "conclusion": "Using Rive to build the Kidzovo mascot was a definitive success. It allowed us to create a highly interactive, performant, and scalable character that has become a core part of the learning experience. This approach set a new standard for how we will approach character animation in future projects."
          },
          "url": "https://ovo.app.promad.design",
          "urlName": "Play with Ovo"
        },
        {
          "name": "Kids' content using AI",
          "description": "Developed coloring sheets, puzzles and music videos for kids using AI",
          "thumbnail": "/images/projects/kidzovo/project-image-3.jpg",
          "tags": [
            "Generative AI",
            "Midjourney",
            "DALL-E",
            "Suno",
            "Udio",
            "Runway",
            "Prompt Engineering"
          ],
          "details": {
            "heading": "Innovative Use of AI in Kids' Content",
            "description": "Leveraged cutting-edge AI technologies to create engaging and educational content for children.",
            "phases": [
              {
                "name": "Generating easily vectorizable Coloring Sheets",
                "points": [
                  "Using Midjourney to generate a large number of coloring sheet ideas.",
                  "Using DALL-E to generate a large number of coloring sheet ideas.",
                  "Using Prompt Engineering to generate a large number of coloring sheet ideas.",
                  "Using AI tools like Midjourney and DALL-E for generating initial content ideas."
                ]
              },
              {
                "name": "Generating Puzzles ",
                "points": [
                  "Using DALL-E and Midjourney to generate a large number of puzzle ideas."
                ]
              },
              {
                "name": "Generating music videos",
                "points": [
                  "Using Suno and Udio to songs",
                  "Using Runway to turn images from midjourney into videos"
                ]
              }
            ],
            "keyOutcomes": {
              "heading": "Key Outcomes",
              "points": [
                "Enhanced Creativity: AI tools expanded the creative possibilities for content creation.",
                "Efficient Production: Streamlined content creation process, reducing time and resources needed.",
                "Positive User Feedback: Children and parents appreciated the innovative and engaging content."
              ]
            }
          }
        },
        {
          "name": "Branding, social media and growth",
          "description": "Developed engaging interactive animations for enhanced user engagement",
          "thumbnail": "/images/projects/kidzovo/project-image-4.jpg",
          "tags": [
            "Animation",
            "Interactive",
            "Rive"
          ],
          "details": "Utilized Rive for scalable and performant animations.",
          "url": "https://linktr.ee/kidzovo",
          "urlName": "See Socials"
        },
        {
          "name": "Website design and development",
          "description": "Built responsive and interactive websites",
          "thumbnail": "/images/projects/kidzovo/project-image-5.jpg",
          "tags": [
            "No-code",
            "Web Design",
            "Responsive"
          ],
          "details": "Managed full lifecycle of website development using Webflow.",
          "url": "https://kidzovo.com",
          "urlName": "Visit Website"
        }
      ]
    },
    {
      "name": "Proffy",
      "period": "2024 - 2025",
      "description": "Job matching platform design",
      "thumbnail": "/images/projects/proffy/thumbnail.png",
      "logo": {
        "dark": "/images/projects/proffy/proffy_logo_dark.png",
        "light": "/images/projects/proffy/proffy_logo_white.png"
      },
      "projects": [
        {
          "name": "Employer Platform",
          "description": "Recruitment and candidate management system",
          "thumbnail": "/images/projects/proffy/project-image-1.jpg",
          "tags": [
            "Product Design",
            "Recruitment",
            "HR"
          ],
          "details": "Designed tools for employers to efficiently manage job postings and candidates.",
          "url": "https://example.com/proffy-employer",
          "urlName": "Employer Platform"
        },
        {
          "name": "Job Seeker Platform",
          "description": "Job search and application management system",
          "thumbnail": "/images/projects/proffy/project-image-2.jpg",
          "tags": [
            "Product Design",
            "Job Search",
            "UX/UI"
          ],
          "details": "Created an intuitive platform for job seekers to find and apply for jobs.",
          "url": "https://example.com/proffy-seeker",
          "urlName": "Job Seeker Platform"
        }
      ]
    },
    {
      "name": "myAIcademy",
      "period": "Mar 2025 - Present",
      "description": "Designing an MVP app for a gamified AI learning experience",
      "thumbnail": "/images/projects/myAIcademy/thumbnail.png",
      "logo": {
        "dark": "/images/projects/myAIcademy/myAIcademy_logo_dark.png",
        "light": "/images/projects/myAIcademy/myAIcademy_logo_white.png"
      },
      "projects": [
        {
          "name": "myAIcademy learning app",
          "description": "Gamified AI learning application design",
          "thumbnail": "/images/projects/myAIcademy/project-image-1.jpg",
          "tags": [
            "Product Design",
            "Education",
            "Gamification"
          ],
          "details": "Developing an engaging platform for learning AI in a gamified way, targetted at teens and tweens."
        },
        {
          "name": "Visual Content",
          "description": "Created educational videos and app illustrations",
          "thumbnail": "/images/projects/myAIcademy/project-image-2.jpg",
          "tags": [
            "Animation",
            "Illustration",
            "Education",
            "AI"
          ],
          "details": "Produced courses for the myAIcademy learning app, using AI to generate voiceovers and illustrations."
        }
      ]
    },
    {
      "name": "ClearTax",
      "period": "Dec 2019 - Jul 2021",
      "description": "Product design for tax compliance and financial solutions",
      "thumbnail": "/images/projects/clear/thumbnail.png",
      "logo": {
        "dark": "/images/projects/clear/clear_logo.png",
        "light": "/images/projects/clear/clear_logo.png"
      },
      "projects": [
        {
          "name": "E-Invoicing and E-Waybill Tool",
          "description": "Designed India's most user-friendly e-Invoicing & e-Way bill platform featuring an intuitive interface, real-time error detection, smart validation prompts, customizable dashboards, and seamless ERP integration, all wrapped in a modern design that processes invoices in under 200ms with enterprise-grade security and 24/7 expert support to ensure a frictionless compliance experience.",
          "thumbnail": "/images/projects/clear/project-image-1.jpg",
          "tags": [
            "Product Design",
            "Finance",
            "Analytics"
          ],
          "details": "Developed a tool to automate reconciliation of financial data.",
          "url": "https://cleartax.in/s/e-invoicing-enterprise-software",
          "urlName": "View E-Invoicing and E-Waybill Tool"
        },
        {
          "name": "MaxITC",
          "description": "Revolutionized input tax credit management with an elegantly crafted AI platform that delivers a 7% profit boost through intelligent vendor management, seamless team collaboration, and automated reconciliation—all wrapped in an intuitive interface that transforms complex ITC claims into a visual, autopilot experience with real-time insights and smart suggestions.",
          "thumbnail": "/images/projects/clear/project-image-2.jpg",
          "tags": [
            "Product Design",
            "Tax",
            "Analytics"
          ],
          "details": "Optimized input tax credit claims for businesses.",
          "url": "https://cleartax.in/s/max-itc",
          "urlName": "Learn about Max ITC"
        },
        {
          "name": "AP Automationand Vendor Management Portal",
          "description": "Transformed accounts payable experience with an elegantly designed AI-powered platform that streamlines vendor relationships through intuitive onboarding flows, real-time communication channels, intelligent compliance checks, and automated payment processing—all unified in a clean, modern interface that makes managing vendor relationships as simple as a single click.",
          "thumbnail": "/images/projects/clear/project-image-3.jpg",
          "tags": [
            "Product Design",
            "Tax",
            "Analytics"
          ],
          "details": "Elevate your accounts payable with AI automation. Get vendor delight, working capital visibility and unrivaled process quality.",
          "url": "https://www.clear.in/ap-automation-software",
          "urlName": "Learn about Clear AP"
        },
        {
          "name": "GST Platform",
          "description": "Designed an end-to-end GST compliance and filing platform that streamlines tax management. It automates compliance checks, provides real-time insights, and offers smart reporting to compare GST returns, view stock/ledger/cash balances, and get summaries by HSN and suppliers.",
          "thumbnail": "/images/projects/clear/project-image-4.jpg",
          "tags": [
            "Product Design",
            "Tax",
            "Enterprise"
          ],
          "details": "Designed a comprehensive platform for GST filing and compliance.",
          "url": "https://cleartax.in/gst",
          "urlName": "Explore GST Platform"
        },
        {
          "name": "Design System",
          "description": "Unified component library and design guidelines",
          "thumbnail": "/images/projects/clear/project-image-5.jpg",
          "tags": [
            "Design System",
            "Documentation",
            "Components"
          ],
          "details": "Created a scalable design system for the entire Enterprise product suite to ensure consistent product development at speed."
        }
      ]
    },
    {
      "name": "Turing",
      "period": "March 2019 - July 2019, Apr 2020 - Feb 2021, Aug 2024 - Present",
      "description": "Designing for Industry scale IoT applications",
      "thumbnail": "/images/projects/turing/thumbnail.png",
      "logo": {
        "dark": "/images/projects/turing/turing_logo.png",
        "light": "/images/projects/turing/turing_logo.png"
      },
      "projects": [
        {
          "name": "TOPGreen Planner and Intel Tools",
          "description": "Designing AI - powered IoT solutions for landscaping for planning, monitoring and analysis.",
          "thumbnail": "/images/projects/turing/project-image-1.png",
          "tags": [
            "SaaS",
            "Landscaping ",
            "IoT\n",
            "Geovisualization"
          ],
          "details": "Designing AI - powered IoT solutions for landscaping for planning, monitoring and analysis.",
          "url": "https://topgreen.ai/",
          "urlName": "More about TOPGreen"
        },
        {
          "name": "urbanEye Dashboard",
          "description": "Designed the landsacape management system for NParks - The National Parks Board of Singapore\n",
          "thumbnail": "/images/projects/turing/project-image-2.png",
          "tags": [
            "Dashboard",
            "Landscaping",
            "Analytics",
            "IoT",
            "Geovisualization"
          ],
          "details": "Landscaping management system for NParks - The National Parks Board of Singapore"
        },
        {
          "name": "rEye IoT platform ",
          "description": "Designed mobile and dashboard solution for IoT water management solutions",
          "thumbnail": "/images/projects/turing/project-image-4.png",
          "tags": [
            "IoT",
            "Mobile",
            "Dashboard"
          ],
          "details": "Designed mobile and dashboard solution for IoT water management solutions"
        },
        {
          "name": "rEye Enterprise Dashboard",
          "description": "Remote monitoring system for IoT Devices and Users across multiple sites around the globe",
          "thumbnail": "/images/projects/turing/project-image-3.png",
          "tags": [
            "IoT",
            "Monitoring",
            "Dashboard",
            "Enterprise SaaS\n"
          ],
          "details": "Remote monitoring system for IoT Devices and Users across multiple sites around the globe"
        },
        {
          "name": "Company Websites",
          "description": "Designed and developed company landing pages using Wix and Wordpress",
          "thumbnail": "/images/projects/turing/project-image-4.png",
          "tags": [
            "Web Design",
            "WordPress",
            "Wix"
          ],
          "details": "Crafted engaging and informative websites for various companies.",
          "url": "https://topgreen.ai/",
          "urlName": "Latest iteration of the TOPGreen website"
        }
      ]
    },
    {
      "name": "The Manufacturing Project",
      "period": "Feb 2025 - Present",
      "description": "Marketing and branding solutions",
      "thumbnail": "/images/projects/TMP/thumbnail.png",
      "logo": {
        "dark": "/images/projects/TMP/tmp_logo.png",
        "light": "/images/projects/TMP/tmp_logo.png"
      },
      "projects": [
        {
          "name": "Brand Strategy",
          "description": "Developed brand strategy and visual identity",
          "thumbnail": "/images/projects/TMP/project-image-1.jpg",
          "tags": [
            "Branding",
            "Strategy",
            "Visual Design"
          ],
          "details": "Formulated strategies to enhance brand recognition and market presence."
        },
        {
          "name": "Website Design",
          "description": "Created responsive website with content management",
          "thumbnail": "/images/projects/TMP/project-image-3.jpg",
          "tags": [
            "Web Design",
            "Wix",
            "CMS"
          ],
          "details": "Designed and implemented user-friendly websites with integrated CMS."
        },
        {
          "name": "Marketing Materials",
          "description": "Designed print and digital marketing collateral",
          "thumbnail": "/images/projects/TMP/project-image-2.jpg",
          "tags": [
            "Print",
            "Marketing",
            "Brochure"
          ],
          "details": "Produced various marketing materials for campaigns and promotions.",
          "url": "https://themfgproject.com",
          "urlName": "Visit Website"
        }
      ]
    },
    {
      "name": "goStops",
      "period": "Jun e2017 - November 2019, October - December 2023",
      "description": "Travel platform branding and product design for goStops",
      "thumbnail": "/images/projects/gostops/thumbnail.png",
      "logo": {
        "dark": "/images/projects/gostops/gostops_logo_white.png",
        "light": "/images/projects/gostops/gostops_logo_dark.png"
      },
      "projects": [
        {
          "name": "Brand Identity",
          "description": "Developed comprehensive brand identity and guidelines",
          "thumbnail": "/images/projects/gostops/project-image-1.jpg",
          "tags": [
            "Branding",
            "Visual Design",
            "Guidelines"
          ],
          "details": "Defined the visual and verbal identity for the travel brand.",
          "url": "https://supro.promad.design/projects/4.html",
          "urlName": "Brand Guidelines"
        },
        {
          "name": "Poster Design",
          "description": "Designed posters for the goStops brand",
          "thumbnail": "/images/projects/gostops/project-image-2.jpg",
          "tags": [
            "Branding",
            "Visual Design",
            "Guidelines"
          ],
          "details": "Defined the visual and verbal identity for the travel brand."
        },
        {
          "name": "Mobile App Improvements",
          "description": "Designed user interface for goStops apps for Guests and Staff",
          "thumbnail": "/images/projects/gostops/project-image-3.jpg",
          "tags": [
            "Mobile",
            "UX/UI",
            "Travel"
          ],
          "details": "Created a seamless mobile experience for booking travel accommodations."
        }
      ]
    },
    {
      "name": "1mg",
      "period": "January 2019 - August 2019",
      "description": "Healthcare platform design and motion graphics",
      "thumbnail": "/images/projects/1mg/thumbnail.png",
      "logo": {
        "dark": "/images/projects/1mg/1mg_logo.png",
        "light": "/images/projects/1mg/1mg_logo.png"
      },
      "projects": [
        {
          "name": "UX of Prescription Drugs Detail Page",
          "description": "The bread and butter of the 1mg platform",
          "thumbnail": "/images/projects/1mg/project-image-1.jpg",
          "tags": [
            "Healthcare",
            "Product Design",
            "UX/UI"
          ],
          "details": "The bread and butter of the 1mg platform",
          "url": "https://www.1mg.com/drugs/brufen-400-tablet-1002088",
          "urlName": "View Current design"
        },
        {
          "name": "Motion Design Guidelines",
          "description": "Motion Design Guidelines for the 1mg platform",
          "thumbnail": "/images/projects/1mg/project-image-2.jpg",
          "tags": [
            "Motion Design",
            "Micro-interactions",
            "Healthcare"
          ],
          "details": "Conducted user research to identify pain points and optimize flows.",
          "url": "https://docs.google.com/presentation/d/14nc7kSlizIbfCGv3G9dj_-TmDJPgAyIY/edit?usp=sharing&ouid=111513387998003419295&rtpof=true&sd=true",
          "urlName": "View Guidelines"
        },
        {
          "name": "Design System",
          "description": "Design System for the 1mg platform",
          "thumbnail": "/images/projects/1mg/project-image-3.jpg",
          "tags": [
            "Design System",
            "Documentation",
            "Components"
          ],
          "details": "Developed a design system for the 1mg platform.",
          "url": "https://drive.google.com/file/d/128hnSykvNBKRYkgcdmOVfueBT7C9yc_7/view?usp=drive_link",
          "urlName": "View Design System"
        },
        {
          "name": "Motion Design for the 1mg",
          "description": "Motion Design for the 1mg platform",
          "thumbnail": "/images/projects/1mg/project-image-2.jpg",
          "tags": [
            "Motion",
            "Product",
            "Healthcare"
          ],
          "details": "Created interactive demos to showcase new features and products.",
          "url": "https://drive.google.com/drive/folders/1nchrPXXEg1MyLzL076_Ca-YawDdgDKMW?usp=drive_link",
          "urlName": "Raw Dump of Motion Design"
        }
      ]
    },
    {
      "name": "Microsoft",
      "period": "June 2017 - August 2019",
      "description": "Product design for enterprise solutions",
      "thumbnail": "/images/projects/microsoft/thumbnail.png",
      "logo": {
        "dark": "/images/projects/microsoft/microsoft_logo.png",
        "light": "/images/projects/microsoft/microsoft_logo.png"
      },
      "projects": [
        {
          "name": "Bing Places for Business",
          "description": "Business listing and management platform",
          "thumbnail": "/images/projects/microsoft/project-image-1.jpg",
          "tags": [
            "Product Design",
            "Enterprise",
            "Maps"
          ],
          "details": "Improved local business visibility and management tools."
        },
        {
          "name": "SharePoint Desktop App",
          "description": "Desktop application for SharePoint ",
          "thumbnail": "/images/projects/microsoft/project-image-2.jpg",
          "tags": [
            "Product Design",
            "Enterprise",
            "Collaboration"
          ],
          "details": "Enhanced desktop experience for SharePoint intranet users."
        },
        {
          "name": "Videos @ Microsoft",
          "description": "Created product demonstration and training content",
          "thumbnail": "/images/projects/microsoft/project-image-3.jpg",
          "tags": [
            "Education",
            "Video",
            "Documentation"
          ],
          "details": "Developed engaging training materials for new product features.",
          "url": "https://drive.google.com/drive/folders/150pz4tZxuvEkk94QnlO-ZU2uJI-so6wg?usp=drive_link",
          "urlName": "Raw Dump of Videos"
        }
      ]
    },
    {
      "name": "Merkle Science",
      "period": "Aug 2021 - Sep 2022",
      "description": "Product design and management for blockchain analytics and compliance solutions",
      "thumbnail": "/images/projects/merkle/thumbnail.png",
      "logo": {
        "dark": "/images/projects/merkle/merklescience_logo_blue.png",
        "light": "/images/projects/merkle/merklescience_logo_white.png"
      },
      "projects": [
        {
          "name": "Compass",
          "description": "Revamped and enhaced the blockchain analytics dashboard for tracking and monitoring cryptocurrency transactions to handle scales of Crypto.com",
          "thumbnail": "/images/projects/merkle/project-image-1.jpg",
          "tags": [
            "Product Design",
            "Product Management",
            "Data Visualization"
          ],
          "details": "Revamped and enhaced the blockchain analytics dashboard for tracking and monitoring cryptocurrency transactions to handle scales of Crypto.com",
          "url": "https://www.merklescience.com/platform/transaction-wallet-monitoring",
          "urlName": "Explore Compass"
        },
        {
          "name": "Tracker",
          "description": "Designing a visualization tool to effortlessly track and trace cryptocurrency transactions to be used by Law Enforcement Agency",
          "thumbnail": "/images/projects/merkle/project-image-2.jpg",
          "tags": [
            "Product Design",
            "Visualization",
            "Product Management"
          ],
          "details": "Implemented real-time data visualization for investigation.",
          "url": "https://www.merklescience.com/platform/cryptocrime-investigation",
          "urlName": "View Tracker"
        },
        {
          "name": "KYBB",
          "description": "Know Your Business Blockchain compliance tool for enterprise",
          "thumbnail": "/images/projects/merkle/project-image-3.jpg",
          "tags": [
            "Product Design",
            "Enterprise",
            "Compliance"
          ],
          "details": "Streamlined onboarding and compliance processes for businesses.",
          "url": "https://www.merklescience.com/platform/kybb-enterprise-compliance-tool",
          "urlName": "Learn about KYBB"
        }
      ]
    }
  ]
}